Chace0219/PIC18F_TCP-IP-STACK/framework/tcpip/src/udp_performance_test.c
/*******************************************************************************
  Company:
    Microchip Technology Inc.

  File Name:
    udp_performance_test.c

  Summary:
    Module for Microchip TCP/IP Stack
     -Sends out dummy packets from ROM memory
     -Reference: None.  This is for testing only.

  Description:
    UDP Performance Test

 *******************************************************************************/

//DOM-IGNORE-BEGIN
/*******************************************************************************
Copyright (c) <2014> released Microchip Technology Inc.  All rights reserved.
 * Confirmed By jinzhouyun, Date 2016.10.01
 *******************************************************************************/
//DOM-IGNORE-END

#define __UDP_PERFORMANCE_TEST_C_

#include <xc.h>
#include "tcpip/tcpip.h"

#if defined(STACK_USE_UDP_PERFORMANCE_TEST)

// Which UDP port to broadcast from for the UDP tests
#define PERFORMANCE_PORT  9

/*****************************************************************************
  Function:
    void UDPPerformanceTask(void)

  Summary:
    Tests the transmit performance of the UDP module.

  Description:
    This function tests the transmit performance of the UDP module.  At boot,
    this module will transmit 1024 large UDP broadcast packets of 1024 bytes
    each.  Using a packet sniffer, one can determine how long this process
    takes and calculate the transmit rate of the stack.  This function tests
    true UDP performance in that it will open a socket, transmit one packet,
    and close the socket for each loop.  After this initial transmission, the
    module can be re-enabled by holding button 3.

    This function is particularly useful after development to determine the
    impact of your application code on the stack's performance.  A before and
    after comparison will indicate if your application is unacceptably
    blocking the processor or taking too long to execute.

  Precondition:
    UDP is initialized.

  Parameters:
    None

  Returns:
    None
 ***************************************************************************/
void UDPPerformanceTask(void)
{
    UDP_SOCKET MySocket;
    NODE_INFO Remote;
    uint16_t wTemp;
    static uint32_t dwCounter = 1;

    if ((BUTTON3_IO) && (dwCounter > 1024u))
        return;

    // Suppress transmissions if we don't have an Ethernet link so our counter starts correctly at 0x00000001
    if (!MACIsLinked())
        return;

#if defined(STACK_USE_DHCP_CLIENT) && defined(STACK_USE_UDP_PERFORMANCE_TEST)
    {
        static uint32_t dwTimer = 0;

        // Wait until DHCP module is finished
        if (!DHCPIsBound(0)) {
            dwTimer = TickGet();
            return;
        }

        // Wait an additional half second after DHCP is finished to let the announce module and any other stack state machines to reach normal operation
        if (TickGet() - dwTimer < TICK_SECOND / 2)
            return;
    }
#endif

    // Set the socket's destination to be a broadcast over our IP
    // subnet
    // Set the MAC destination to be a broadcast
    memset(&Remote, 0xFF, sizeof (Remote));

    // Open a UDP socket for outbound transmission
    MySocket = UDPOpenEx((uint32_t) (PTR_BASE) & Remote, UDP_OPEN_NODE_INFO, 0, PERFORMANCE_PORT);
    //MySocket = UDPOpen(0, &Remote, PERFORMANCE_PORT);

    // Abort operation if no UDP sockets are available
    // If this ever happens, incrementing MAX_UDP_SOCKETS in
    // stack_task.h may help (at the expense of more global memory
    // resources).
    if (MySocket == INVALID_UDP_SOCKET)
        return;

    // Make certain the socket can be written to
    if (!UDPIsPutReady(MySocket)) {
        UDPClose(MySocket);
        return;
    }

    // Put counter value into first 4 bytes of the packet
    UDPPutArray((uint8_t *) & dwCounter, sizeof (dwCounter));
    dwCounter++;

    wTemp = UDPPutROMArray((ROM uint8_t *)
            "The quick brown fox tried to jump over the yellow dog.  Unfortunately, the yellow dog stood up while the fox was in mid-jump.  As a result, the two collided.  Then, the dog, being the omnivore that it is, ate the quick brown fox.  This line is 256 bytes.\r\n"
            "The quick brown fox tried to jump over the yellow dog.  Unfortunately, the yellow dog stood up while the fox was in mid-jump.  As a result, the two collided.  Then, the dog, being the omnivore that it is, ate the quick brown fox.  This line is 256 bytes.\r\n"
            "The quick brown fox tried to jump over the yellow dog.  Unfortunately, the yellow dog stood up while the fox was in mid-jump.  As a result, the two collided.  Then, the dog, being the omnivore that it is, ate the quick brown fox.  This line is 256 bytes.\r\n"
            "The quick brown fox tried to jump over the yellow dog.  Unfortunately, the yellow dog stood up while the fox was in mid-jump.  As a result, the two collided.  Then, the dog, being the omnivore that it is, ate the quick brown fox.  This line is 252b. \r\n", 1020);

    // Send the packet
    UDPFlush();

    // Close the socket so it can be used by other modules
    UDPClose(MySocket);
}

#endif // #if defined(STACK_USE_UDP_PERFORMANCE_TEST)
